c
c
c***************************************************
c       п/п векторного умножения векторов.
c***************************************************
c
c       (а) и (в) - исходные вектора
c       (с) - результат
c       na,nb,nc - номера векторов
c
c
	subroutine umvekt(a,b,c,na,nb,nc)
	dimension a(10,4,1),b(10,4,1),c(10,4,1)
	c(nc,1,1)=a(na,2,1)*b(nb,3,1)-a(na,3,1)*b(nb,2,1)
	c(nc,2,1)=a(na,3,1)*b(nb,1,1)-a(na,1,1)*b(nb,3,1)
	c(nc,3,1)=a(na,1,1)*b(nb,2,1)-a(na,2,1)*b(nb,1,1)
	c(nc,4,1)=1.
	return
	end
